[
    {
        "image": "https://randomuser.me/api/portraits/women/12.jpg",
        "name": "Sara trammell",
        "position": "Director of marketing at optery",
        "review":"“Discovering Be the Buzz (BTB) turned out to be a game-changer for me as a cybersecurity marketing leader at a startup. Their influence wasn't just about optimizing campaigns; it was about building meaningful connections at scale, all atop an integrated digital marketing strategy. In a field as competitive as ours, finding an agency like BTB that not only deeply understands your market but also passionately supports your vision is priceless. A significant part of this success can be attributed to Miad, among the most strategic minds I've encountered. She has assembled a team of unparalleled experts, each excelling in their craft, embodying a level of expertise and commitment that's exceptionally rare. With BTB, we didn't merely hit our immediate objectives; we laid the groundwork for sustained success. Hands down, I will work with them again!”"
    },
    {
        "image": "https://randomuser.me/api/portraits/women/24.jpg",
        "name": "Sarah Craft",
        "position": "CEO of koilsocial",
        "review":"“When working with BetheBuzz, I never felt like a client. As my right-hand person, Miad has personally helped me outline my product development life cycle and prepare for investor presentations with a thorough go-to-market plan. Her ability to read between the lines of any business plan to determine the most cost-effective, efficient way to move forward is uncanny. I’ve never felt so empowered to take on the challenges of growing a new business than I have when working with Miad.”"

    },
    {
        "image": "https://randomuser.me/api/portraits/women/23.jpg",
        "name": "Meredith Watkins",
        "position": "CEO & Managing Partner",
        "review":"“When working with BetheBuzz, I never felt like a client. Her ability to read between the lines of any business plan to determine the most cost-effective, efficient way to move forward is uncanny. Not only that, she goes above and beyond – learning about the team dynamics to ensure everyone is working cohesively toward a common goal. I’ve never felt so empowered to take on the challenges of growing a new business than I have when working with Miad.”"

    }
]